RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/capsense/cy_capsense_generator_v3.h
/***************************************************************************//**
* \file cy_capsense_generator_v3.h
* \version 3.0
*
* \brief
* This file provides the function prototypes specific to the register
* map generation module.
*
********************************************************************************
* \copyright
* Copyright 2020-2021, Cypress Semiconductor Corporation (an Infineon company)
* or an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


#if !defined(CY_CAPSENSE_GENERATOR_V3_H)
#define CY_CAPSENSE_GENERATOR_V3_H

#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sm_base_full_wave_v3.h"

#if (defined(CY_IP_M0S8MSCV3))

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
* Function Prototypes
*******************************************************************************/



/******************************************************************************/
/** \cond SECTION_CAPSENSE_INTERNAL */
/** \addtogroup group_capsense_internal *//** \{ */
/******************************************************************************/
cy_capsense_status_t Cy_CapSense_GenerateBaseConfig(
                uint32_t chIndex,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_GenerateSensorConfig(
                uint32_t chIndex,
                uint32_t scanSlot,
                uint32_t * ptrSensorCfg,
                cy_stc_capsense_context_t * context);
void Cy_CapSense_GenerateAllSensorConfig(
                uint32_t chId,
                uint32_t * ptrSensorCfg,
                cy_stc_capsense_context_t * context);
cy_capsense_status_t Cy_CapSense_GenerateCdacConfig(
                uint32_t scanSlot,
                uint32_t * ptrSensorCfg,
                const cy_stc_capsense_context_t * context);

#if (CY_CAPSENSE_SENSOR_CONNECTION_MODE == CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD)
void Cy_CapSense_CalculateMaskRegisters(
                uint32_t mask,
                uint32_t funcState,
                uint32_t * ptrCfg);
#endif

/** \} \endcond */


/*******************************************************************************
* Sensor Config Register indexes in the frame
*******************************************************************************/
#define CY_CAPSENSE_SNS_SW_SEL_CSW_MASK2_INDEX                                  (0u)
#define CY_CAPSENSE_SNS_SW_SEL_CSW_MASK1_INDEX                                  (1u)
#define CY_CAPSENSE_SNS_SW_SEL_CSW_MASK0_INDEX                                  (2u)
#define CY_CAPSENSE_SNS_SCAN_CTL_INDEX                                          (3u)
#define CY_CAPSENSE_SNS_CDAC_CTL_INDEX                                          (4u)
#define CY_CAPSENSE_SNS_CTL_INDEX                                               (5u)


/*******************************************************************************
* Macros for Cmod selection
*******************************************************************************/
#define CY_CAPSENSE_MSC0_CMOD1PADD_PIN                                          (2u)
#define CY_CAPSENSE_MSC1_CMOD1PADD_PIN                                          (1u)

#define CY_CAPSENSE_CMOD12_PAIR_SELECTION                                       (0u)
#define CY_CAPSENSE_CMOD34_PAIR_SELECTION                                       (1u)


/*******************************************************************************
* Register definition for FW CSD CTRLMUX with Active Shielding
*******************************************************************************/
#define CY_CAPSENSE_FW_SHIELD_ACTIVE_CTRLMUX_REG_SW_SEL_TOP_MASK                (0x4FFC0000uL)
#define CY_CAPSENSE_FW_SHIELD_ACTIVE_CTRLMUX_REG_SW_SEL_SH_MASK                 (0x80050000uL)
#define CY_CAPSENSE_FW_SHIELD_ACTIVE_CTRLMUX_REG_SW_SEL_TOP_VALUE               (0x44280000uL)
#define CY_CAPSENSE_FW_SHIELD_ACTIVE_CTRLMUX_REG_SW_SEL_SH_VALUE                (0x80050000uL)
#define CY_CAPSENSE_FW_SHIELD_ACTIVE_CTRLMUX_REG_SW_SEL_CSW_VALUE               (0x84022000uL)


/*******************************************************************************
* Register definition for FW CSD CTRLMUX with Passive Shielding
*******************************************************************************/
#define CY_CAPSENSE_FW_SHIELD_PASSIVE_CTRLMUX_REG_SW_SEL_TOP_MASK               (0x0FFC0000uL)
#define CY_CAPSENSE_FW_SHIELD_PASSIVE_CTRLMUX_REG_SW_SEL_TOP_VALUE              (0x09800000uL)
#define CY_CAPSENSE_FW_SHIELD_PASSIVE_CTRLMUX_REG_SW_SEL_CSW_VALUE              (0x09080000uL)


/*******************************************************************************
* Register definition for FW CSD AMUX with Active Shielding
*******************************************************************************/
#define CY_CAPSENSE_FW_SHIELD_ACTIVE_AMUX_REG_SW_SEL_TOP_MASK                   (0x40000000uL)
#define CY_CAPSENSE_FW_SHIELD_ACTIVE_AMUX_REG_SW_SEL_SH_MASK                    (0x80010100uL)
#define CY_CAPSENSE_FW_SHIELD_ACTIVE_AMUX_REG_SW_SEL_TOP_VALUE                  (0x40000000uL)
#define CY_CAPSENSE_FW_SHIELD_ACTIVE_AMUX_REG_SW_SEL_SH_VALUE                   (0x80010100uL)


/*******************************************************************************
* Register definition for FW CSX VDDA/2
*******************************************************************************/
#define CY_CAPSENSE_FW_CSX_VDDA2_CTLMUX_MODE_SW_SEL_SH_VALUE                    (0x87050000uL)
#define CY_CAPSENSE_FW_CSX_VDDA2_AMUX_MODE_SW_SEL_SH_VALUE                      (0x87010100uL)


/*******************************************************************************
* The MODE_SENSE_DUTY_CTL register configuration for the FW CSX AMUX
*******************************************************************************/
#define CY_CAPSENSE_FW_CSX_AMUX_MODE_SENSE_DUTY_CTL_VALUE                       (0x11000000uL)


